In [1]:
import pandas as pd

In [4]:
df_ventas = pd.read_csv("files/ventas.csv")
df_ventas.head()

   ID_Cliente ID_Producto Fecha_Venta  Cantidad  Total
0         723          A1  2023-11-22         2  17.98
1         498          C3  2023-11-21         1   5.49
2         121          D4  2023-11-20         3  32.97
3         885         L12  2023-11-19         1   6.49
4         347         Q17  2023-11-18         2   7.98

In [5]:
df_clientes = pd.read_csv("files/clientes.csv")
df_clientes.head()

,id,first_name,last_name,email,gender,City,Country,Address
0,1,Cheri,Dunsmore,cdunsmore0@instagram.com,Female,Palma De Mallorca,Spain,076 Rockefeller Crossing
1,2,Hunt,Bartomeu,hbartomeu1@nsw.gov.au,Male,Lugo,Spain,0046 Utah Junction
2,3,Michaeline,Paynton,mpaynton2@narod.ru,Female,NaN,Spain,0 Corry Crossing
3,4,Filmer,Eirwin,feirwin3@intel.com,NaN,Leon,Spain,5 American Ash Road
4,5,Tanhya,Lubbock,tlubbock4@huffingtonpost.com,Female,"Hospitalet De Llobregat, L'",Spain,9289 Merry Circle

In [9]:
df_productos = pd.read_csv("files/productos.csv", sep=";")
df_productos.head()

,ID,Nombre_Producto,Categoría,Precio,Origen,Descripción
0,A1,Pizza Margherita,Platos Preparados,8.99,Italia,"Clásica pizza italiana con tomate,mozzarella f..."
1,B2,Risotto de Champiñones,Platos Preparados,6.75,Italia,"Risotto cremoso con champiñones frescos,una de..."
2,C3,Tiramisú,Postres,5.49,Italia,Postre clásico italiano con capas de bizcocho ...
3,D4,Panettone,Repostería,10.99,Italia,Pan dulce navideño italiano con frutas confita...
4,E5,Orecchiette,Productos Secos,4.29,Italia,Pequeñas pastas con forma de orecchiette ideal...

In [10]:
df_productos = pd.read_csv("files/productos.csv", delimiter=";")
df_productos.head()

,ID,Nombre_Producto,Categoría,Precio,Origen,Descripción
0,A1,Pizza Margherita,Platos Preparados,8.99,Italia,"Clásica pizza italiana con tomate,mozzarella f..."
1,B2,Risotto de Champiñones,Platos Preparados,6.75,Italia,"Risotto cremoso con champiñones frescos,una de..."
2,C3,Tiramisú,Postres,5.49,Italia,Postre clásico italiano con capas de bizcocho ...
3,D4,Panettone,Repostería,10.99,Italia,Pan dulce navideño italiano con frutas confita...
4,E5,Orecchiette,Productos Secos,4.29,Italia,Pequeñas pastas con forma de orecchiette ideal...

In [11]:
df_ventas.shape

(100, 5)

In [12]:
df_clientes.shape

(1000, 8)

In [13]:
df_productos.shape

(33, 6)

In [16]:
df_clientes.isnull().sum()

id              0
first_name      0
last_name       0
email          27
gender         77
City          124
Country       154
Address        41
dtype: int64

In [17]:
df_productos.isnull().sum()

ID                 0
Nombre_Producto    0
Categoría          0
Precio             0
Origen             0
Descripción        0
dtype: int64

In [20]:
df_clientes[["City", "Country", "Address"]]

                            City Country                   Address
0              Palma De Mallorca   Spain  076 Rockefeller Crossing
1                           Lugo   Spain        0046 Utah Junction
2                            NaN   Spain          0 Corry Crossing
3                           Leon   Spain       5 American Ash Road
4    Hospitalet De Llobregat, L'   Spain         9289 Merry Circle
..                           ...     ...                       ...
995                       Zamora   Spain     36384 Sommers Terrace
996                   Pontevedra   Spain    93177 Eastwood Parkway
997                         Vigo   Spain       03044 Grayhawk Road
998                 Dos Hermanas   Spain        2 Schmedeman Drive
999                         Leon   Spain     42274 Waywood Terrace

[1000 rows x 3 columns]

In [23]:
df_clientes["City"].unique()

array(['Palma De Mallorca', 'Lugo', nan, 'Leon',
       "Hospitalet De Llobregat, L'", 'Lleida', 'Santander', 'Malaga',
       'Valladolid', 'Murcia', 'Pamplona/Iruña', 'Barcelona', 'Palencia',
       'Pontevedra', 'Girona', 'Fuenlabrada', 'Jaen', 'Almeria',
       'Elx/Elche', 'Getafe', 'Sevilla', 'Coruña, A', 'Zaragoza',
       'Palmas De Gran Canaria, Las', 'Cadiz', 'Tarragona',
       'Santiago De Compostela', 'Donostia-San Sebastian', 'Cartagena',
       'Madrid', 'Ceuta', 'Vigo', 'Valencia', 'Sabadell', 'Granada',
       'Albacete', 'Teruel', 'Aviles',
       'Castellon De La Plana/Castello De La Pla', 'Vitoria-Gasteiz',
       'Zamora', 'Santa Cruz De Tenerife', 'Logroño', 'Torrevieja',
       'Leganes', 'Gijon', 'Toledo', 'Badajoz', 'Dos Hermanas', 'Ourense',
       'Ferrol', 'Salamanca', 'Sant Cugat Del Valles', 'Huesca',
       'Alicante/Alacant', 'Telde'], dtype=object)

In [24]:
df_clientes["Country"] = df_clientes["Country"].fillna("Spain")

In [34]:
df_clientes["gender"].unique()

array(['Female', 'Male', nan, 'Polygender', 'Genderfluid', 'Non-binary',
       'Agender', 'Bigender', 'Genderqueer'], dtype=object)

In [36]:
df_clientes.duplicated().sum()

np.int64(0)

In [37]:
df_ventas.duplicated().sum()

np.int64(0)

In [38]:
df_productos.duplicated().sum()

np.int64(0)